#### ExportFontKey Members

---

|  |
| --- |
| ExportFontKey Class   Constructors   Methods   Properties   See Also |

The  ExportFontKey  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ExportFontKey | Constructs a new default ExportFontKey. |
| Public method | ExportFontKey(String) | Constructs a new ExportFontKey using an input font name. |
| Public method | ExportFontKey(ExportFontKey) | Constructs a new copy of the input ExportFontKey object. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ExportFontKey |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | OriginalFontName | The original font name. |

# See Also

ExportFontKey Class

Autodesk.Revit.DB Namespace